src/stage-1-prototype/InformationRegisters/Расш1_СостояниеЗаказовБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Расш1_СостояниеЗаказовБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>ОперацияId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияСвязи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследняяУдаленнаяЗадача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/stage-1-prototype/InformationRegisters/Расш1_ЖурналОперацийБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Расш1_ЖурналОперацийБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОперацияId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазаId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Портал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнициаторId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СеансId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоUTC</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СледующаяПроверкаUTC</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СнимокJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадачаId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияСвязи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправкаНачата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/stage-1-prototype/InformationRegisters/Расш1_СвязиЗаказовБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Расш1_СвязиЗаказовБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗадачаId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОперацияId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
<Resource>
	<Properties>
		<Name>Портал</Name>
		<Type>
			<v8:Type>xs:string</v8:Type>
			<v8:StringQualifiers>
				<v8:Length>255</v8:Length>
			</v8:StringQualifiers>
		</Type>
	</Properties>
</Resource>

<Resource>
	<Properties>
		<Name>Ссылка</Name>
		<Type>
			<v8:Type>xs:string</v8:Type>
			<v8:StringQualifiers>
				<v8:Length>0</v8:Length>
			</v8:StringQualifiers>
		</Type>
	</Properties>
</Resource>

<Resource>
	<Properties>
		<Name>Название</Name>
		<Type>
			<v8:Type>xs:string</v8:Type>
			<v8:StringQualifiers>
				<v8:Length>0</v8:Length>
			</v8:StringQualifiers>
		</Type>
	</Properties>
</Resource>

		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/stage-1-prototype/InformationRegisters/Расш1_НастройкиОбменаБ24.xml
<?xml version='1.0' encoding='UTF-8'?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Расш1_НастройкиОбменаБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Секрет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/stage-1-prototype/InformationRegisters/Расш1_УведомленияБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Расш1_УведомленияБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СообщениеId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнициаторId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОперацияId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияСвязи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доставлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/stage-1-prototype/InformationRegisters/Расш1_АудитСвязейБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Расш1_АудитСвязейБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СобытиеId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнициаторId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментUTC</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрежняяЗадача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоваяЗадача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Портал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОперацияId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/stage-1-prototype/CommonModules/Расш1_ОперацииRESTБ24/Ext/Module.bsl
// Серверная основа этапа 2. Не вызывается непосредственно с клиента.
// Все блокировки короткие; HTTP и запуск заданий только после фиксации транзакций.

Функция ПользовательId() Экспорт
    Возврат Строка(ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
КонецФункции

Процедура ПроверитьДоступ(Заказ, Изменение = Ложь) Экспорт
    Если ТипЗнч(Заказ) <> Тип("ДокументСсылка.ЗаказКлиента") Или Не ЗначениеЗаполнено(Заказ) Тогда
        ВызватьИсключение "Не выбран заказ клиента.";
    КонецЕсли;
    Если Не ПравоДоступа("Чтение", Метаданные.Документы.ЗаказКлиента) Тогда
        ВызватьИсключение "Недостаточно прав на заказ.";
    КонецЕсли;
    Если Изменение И Не ПравоДоступа("Изменение", Метаданные.Документы.ЗаказКлиента) Тогда
        ВызватьИсключение "Недостаточно прав на изменение заказа.";
    КонецЕсли;
    // Без привилегированного режима: запрос применяет ограничения доступа к записи.
    Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Документ.ЗаказКлиента ГДЕ Ссылка = &Заказ");
    Запрос.УстановитьПараметр("Заказ", Заказ);
    Если Запрос.Выполнить().Пустой() Тогда ВызватьИсключение "Заказ недоступен."; КонецЕсли;
КонецПроцедуры

Процедура Блокировать()
    Блокировка = Новый БлокировкаДанных;
    // Одинаковый порядок во всех пишущих сервисах. Объём небольшой: создание по одной задаче.
    Для Каждого Имя Из СтрРазделить("Расш1_СостояниеЗаказовБ24,Расш1_ЖурналОперацийБ24,Расш1_СвязиЗаказовБ24", ",") Цикл
        Область = Блокировка.Добавить("РегистрСведений." + Имя);
        Область.Режим = РежимБлокировкиДанных.Исключительный;
    КонецЦикла;
    Блокировка.Заблокировать();
КонецПроцедуры

Функция ЗаписьСостояния(Заказ)
    Запись = РегистрыСведений.Расш1_СостояниеЗаказовБ24.СоздатьМенеджерЗаписи();
    Запись.Заказ = Заказ; Запись.Прочитать(); Запись.Заказ = Заказ;
    Возврат Запись;
КонецФункции

Функция ЗаписьОперации(ОперацияId)
    Запись = РегистрыСведений.Расш1_ЖурналОперацийБ24.СоздатьМенеджерЗаписи();
    Запись.ОперацияId = ОперацияId; Запись.Прочитать(); Запись.ОперацияId = ОперацияId;
    Возврат Запись;
КонецФункции

Функция СвязьЗаказа(Заказ)
    Запись = РегистрыСведений.Расш1_СвязиЗаказовБ24.СоздатьМенеджерЗаписи();
    Запись.Заказ = Заказ; Запись.Прочитать(); Запись.Заказ = Заказ;
    Возврат Запись;
КонецФункции

Функция Незавершена(Состояние) Экспорт
    Возврат Не ПустаяСтрока(Состояние) И Состояние <> "Завершена"
        И Состояние <> "НеОтправлена" И Состояние <> "ОтказAPI";
КонецФункции

Функция РазрешеноСоздание()
    Настройка = РегистрыСведений.Расш1_НастройкиОбменаБ24.СоздатьМенеджерЗаписи();
    Настройка.Ключ = "stage2Enabled"; Настройка.Прочитать();
    Возврат Настройка.Выбран() И Настройка.Значение = "true";
КонецФункции

Функция БазаId()
    Настройка = РегистрыСведений.Расш1_НастройкиОбменаБ24.СоздатьМенеджерЗаписи();
    Настройка.Ключ = "baseId"; Настройка.Прочитать();
    Если Не Настройка.Выбран() Тогда
        Настройка.Ключ = "baseId";
        Настройка.Значение = Строка(Новый УникальныйИдентификатор); Настройка.Записать();
    КонецЕсли;
    Возврат Строка(Новый УникальныйИдентификатор(Настройка.Значение));
КонецФункции

Функция ДанныеЗаказа(Заказ)
    Запрос = Новый Запрос("ВЫБРАТЬ Проведен, ПометкаУдаления, Номер, Дата,
        |ПРЕДСТАВЛЕНИЕ(Контрагент) КАК Контрагент, ПРЕДСТАВЛЕНИЕ(Партнер) КАК Клиент,
        |СуммаДокумента, ПРЕДСТАВЛЕНИЕ(Валюта) КАК Валюта
        |ИЗ Документ.ЗаказКлиента ГДЕ Ссылка = &Заказ");
    Запрос.УстановитьПараметр("Заказ", Заказ);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Не Выборка.Следующий() Тогда ВызватьИсключение "Заказ недоступен."; КонецЕсли;
    Данные = Новый Структура("Проведен,ПометкаУдаления,Номер,Дата,Контрагент,Клиент,Сумма,Валюта,Ссылка");
    ЗаполнитьЗначенияСвойств(Данные, Выборка);
    Данные.Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
    Данные.Сумма = Формат(Выборка.СуммаДокумента, "ЧГ=0; ЧДЦ=2; ЧРД=.");
    Данные.Ссылка = ПолучитьНавигационнуюСсылку(Заказ);
    Возврат Данные;
КонецФункции

Функция Зарезервировать(Заказ, СеансId, ПодтвержденнаяУдаленнаяЗадача = "", ОжидаемаяВерсия = -1) Экспорт
    ПроверитьДоступ(Заказ, Истина);
    Если Не ПравоДоступа("Проведение", Метаданные.Документы.ЗаказКлиента) Тогда
        ВызватьИсключение "Недостаточно прав на проведение заказа.";
    КонецЕсли;
    Данные = ДанныеЗаказа(Заказ);
    Если Не Данные.Проведен Или Данные.ПометкаУдаления Тогда ВызватьИсключение "Сначала успешно проведите заказ."; КонецЕсли;
    Параметры = Расш1_RESTБ24Сервер.ПараметрыНовойОперации();
    Инициатор = ПользовательId();
    ИсходныйРежим = ПривилегированныйРежим();
    УстановитьПривилегированныйРежим(Истина);
    НачатьТранзакцию();
    Попытка
        Блокировать();
        Если Не РазрешеноСоздание() Тогда ВызватьИсключение "Создание задач отключено программистом."; КонецЕсли;
        Связь = СвязьЗаказа(Заказ);
        Если Связь.Выбран() Тогда
            Итог = Новый Структура("Состояние,ОперацияId,ЗадачаId", "Связана", Связь.ОперацияId, Связь.ЗадачаId);
        Иначе
            Состояние = ЗаписьСостояния(Заказ);
            Операция = ЗаписьОперации(Состояние.ОперацияId);
            Если Операция.Выбран() И Незавершена(Операция.Состояние) Тогда
                Итог = Новый Структура("Состояние,ОперацияId,ЗадачаId", Операция.Состояние, Операция.ОперацияId, Операция.ЗадачаId);
            Иначе
                Если Не ПустаяСтрока(Состояние.ПоследняяУдаленнаяЗадача)
                    И (ПодтвержденнаяУдаленнаяЗадача <> Состояние.ПоследняяУдаленнаяЗадача Или ОжидаемаяВерсия <> Состояние.ВерсияСвязи) Тогда
                    ВызватьИсключение "Требуется отдельное подтверждение нового создания после удаления связи.";
                КонецЕсли;
                ОперацияId = Строка(Новый УникальныйИдентификатор);
                Операция = ЗаписьОперации(ОперацияId);
                Операция.Заказ = Заказ; Операция.БазаId = БазаId(); Операция.Портал = Параметры.Портал;
                Операция.ИнициаторId = Инициатор; Операция.СеансId = Лев(СеансId, 128);
                Операция.НачалоUTC = ТекущаяУниверсальнаяДата();
                Операция.СледующаяПроверкаUTC = Операция.НачалоUTC + 30;
                Операция.Состояние = "Резерв"; Операция.ВерсияСвязи = Состояние.ВерсияСвязи;
                Операция.Название = Данные.Контрагент + " — заказ №" + Данные.Номер + " от " + Данные.Дата + ".";
                Поля = Новый Соответствие;
                Поля.Вставить("TITLE", Операция.Название);
                Поля.Вставить("DESCRIPTION", "Заказ №" + Данные.Номер + " от " + Данные.Дата + Символы.ПС
                    + "Клиент: " + Данные.Клиент + Символы.ПС + "Сумма: " + Данные.Сумма + " " + Данные.Валюта
                    + Символы.ПС + "Документ 1С: " + Данные.Ссылка);
                Поля.Вставить("GROUP_ID", Параметры.Данные.Получить("groupId"));
                Поля.Вставить("CREATED_BY", Параметры.Данные.Получить("creatorId"));
                Поля.Вставить("RESPONSIBLE_ID", Параметры.Данные.Получить("responsibleId"));
                Поля.Вставить("AUDITORS", Параметры.Данные.Получить("auditors"));
                Поля.Вставить("DEADLINE", Расш1_RESTБ24Сервер.РассчитатьСрокREST(Операция.НачалоUTC));
                // Полный UUID операции помещается в XML_ID без обрезания в Б24.
                Поля.Вставить("XML_ID", "KA2:" + ОперацияId);
                Операция.СнимокJSON = Расш1_RESTБ24Сервер.JSONСтрока(Новый Структура("fields,order", Поля, Данные));
                Операция.Записать(); Состояние.ОперацияId = ОперацияId; Состояние.Записать();
                Итог = Новый Структура("Состояние,ОперацияId,ЗадачаId", "Резерв", ОперацияId, "");
            КонецЕсли;
        КонецЕсли;
        ЗафиксироватьТранзакцию();
        УстановитьПривилегированныйРежим(ИсходныйРежим);
    Исключение
        ОтменитьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим); ВызватьИсключение;
    КонецПопытки;
    Возврат Итог;
КонецФункции

Процедура Уведомление(Операция, Вид, Текст)
    Запись = РегистрыСведений.Расш1_УведомленияБ24.СоздатьМенеджерЗаписи();
    Ключ = Операция.ОперацияId + ":" + Вид;
    Запись.СообщениеId = Ключ; Запись.Прочитать();
    Если Запись.Выбран() Тогда Возврат; КонецЕсли;
    Запись.СообщениеId = Ключ; Запись.Заказ = Операция.Заказ; Запись.ИнициаторId = Операция.ИнициаторId;
    Запись.ОперацияId = Операция.ОперацияId; Запись.ВерсияСвязи = Операция.ВерсияСвязи;
    Запись.Текст = Текст; Запись.Записать();
КонецПроцедуры

Процедура Аудит(Заказ, Инициатор, Действие, Прежняя, Новая, Портал, ОперацияId)
    Запись = РегистрыСведений.Расш1_АудитСвязейБ24.СоздатьМенеджерЗаписи();
    Запись.СобытиеId = Строка(Новый УникальныйИдентификатор); Запись.Заказ = Заказ;
    Запись.ИнициаторId = Инициатор; Запись.МоментUTC = ТекущаяУниверсальнаяДата(); Запись.Действие = Действие;
    Запись.ПрежняяЗадача = Прежняя; Запись.НоваяЗадача = Новая; Запись.Портал = Портал;
    Запись.ОперацияId = ОперацияId; Запись.Записать();
КонецПроцедуры

// Вызывается только фоновым заданием с UUID. Отправка может произойти один раз.
Процедура ОтправитьОперацию(ОперацияId, ДиагностическийСбой = "") Экспорт
    Если Не ПустаяСтрока(ДиагностическийСбой) Тогда
        Если ДиагностическийСбой <> "after-response" Или Не ПравоДоступа("Администрирование", Метаданные)
            Или СтрНайти(НРег(СтрокаСоединенияИнформационнойБазы()), "ка демо") = 0 Тогда
            ВызватьИсключение "Диагностический сбой доступен только администратору КА Демо.";
        КонецЕсли;
    КонецЕсли;
    ИсходныйРежим = ПривилегированныйРежим(); УстановитьПривилегированныйРежим(Истина);
    НачатьТранзакцию();
    Попытка
        Блокировать(); Операция = ЗаписьОперации(ОперацияId);
        Отправлять = Операция.Выбран() И Операция.Состояние = "Резерв" И Не Операция.ОтправкаНачата;
        Если Отправлять Тогда
            Если Не РазрешеноСоздание() Тогда
                Операция.Состояние = "НеОтправлена";
                Уведомление(Операция, "not-sent", "Задача не создана. Повторите позже");
                Отправлять = Ложь;
            Иначе
                Операция.ОтправкаНачата = Истина; Операция.Состояние = "ОтправкаНачата";
            КонецЕсли;
            Операция.Записать();
        КонецЕсли;
        ЗафиксироватьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим);
    Исключение
        ОтменитьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим); ВызватьИсключение;
    КонецПопытки;
    Если Не Отправлять Тогда Возврат; КонецЕсли;
    Ответ = Расш1_RESTБ24Сервер.СоздатьПоСнимку(Операция.Портал, Операция.СнимокJSON);
    Если ДиагностическийСбой = "after-response" И Ответ.Состояние = "ЗадачаИзвестна" Тогда
        // Управляемая потеря настоящего ответа до фиксации ID. Рабочее задание этот параметр не передаёт.
        ВызватьИсключение "KA2_DIAGNOSTIC_RESPONSE_DISCARDED";
    КонецЕсли;
    СохранитьОтвет(ОперацияId, Ответ);
    Если Ответ.Состояние = "ЗадачаИзвестна" Тогда ЗаписатьСвязь(ОперацияId); КонецЕсли;
КонецПроцедуры

Процедура СохранитьОтвет(ОперацияId, Ответ) Экспорт
    ИсходныйРежим = ПривилегированныйРежим(); УстановитьПривилегированныйРежим(Истина);
    НачатьТранзакцию();
    Попытка
        Блокировать(); Операция = ЗаписьОперации(ОперацияId);
        Если Операция.Выбран() И Незавершена(Операция.Состояние) И Операция.Состояние <> "Конфликт" И ПустаяСтрока(Операция.ЗадачаId) Тогда
            Если Ответ.Состояние = "ЗадачаИзвестна" Тогда
                Операция.ЗадачаId = Ответ.ЗадачаId; Операция.Состояние = "ЗадачаИзвестна";
                Снимок = Расш1_RESTБ24Сервер.ДанныеJSON(Операция.СнимокJSON);
                Исполнитель = Расш1_RESTБ24Сервер.НормализоватьID(Снимок.Получить("fields").Получить("RESPONSIBLE_ID"));
                Операция.Ссылка = "https://" + Операция.Портал + "/company/personal/user/" + Исполнитель + "/tasks/task/view/" + Ответ.ЗадачаId + "/";
                Уведомление(Операция, "known", "Задача №" + Ответ.ЗадачаId + " создана. Связь с заказом ещё не сохранена");
            Иначе
                Операция.Состояние = Ответ.Состояние;
                Если Ответ.Состояние = "ОтказAPI" Тогда
                    Уведомление(Операция, "refusal", "Битрикс24 отказал в создании задачи. Проверьте доступ интеграции.");
                КонецЕсли;
                Если Ответ.Состояние = "НеОтправлена" Тогда Уведомление(Операция, "not-sent", "Задача не создана. Повторите позже"); КонецЕсли;
            КонецЕсли;
            Операция.СледующаяПроверкаUTC = ТекущаяУниверсальнаяДата() + 5; Операция.Записать();
        КонецЕсли;
        ЗафиксироватьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим);
    Исключение
        ОтменитьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим); ВызватьИсключение;
    КонецПопытки;
КонецПроцедуры

// Отдельная транзакция ПОСЛЕ фиксации известного ID. При сбое add не повторяется.
Процедура ЗаписатьСвязь(ОперацияId, ПроверитьСрок = Истина) Экспорт
    ИсходныйРежим = ПривилегированныйРежим(); УстановитьПривилегированныйРежим(Истина);
    Попытка
        ПредварительнаяОперация = ЗаписьОперации(ОперацияId);
        УстановитьПривилегированныйРежим(ИсходныйРежим);
    Исключение
        УстановитьПривилегированныйРежим(ИсходныйРежим); ВызватьИсключение;
    КонецПопытки;
    Просрочена = Ложь;
    Если ПроверитьСрок И ПредварительнаяОперация.Состояние = "ЗадачаИзвестна" Тогда
        Попытка
            Настройки = Расш1_RESTБ24Сервер.ПараметрыНовойОперации();
            Если Настройки.Портал = ПредварительнаяОперация.Портал Тогда
                Ответ = Расш1_RESTБ24Сервер.ПрочитатьЗадачуREST(Число(ПредварительнаяОперация.ЗадачаId));
                Если Ответ.Состояние = "Результат" Тогда
                    Задача = Ответ.Данные.Получить("task");
                    Если ТипЗнч(Задача) = Тип("Соответствие") И Расш1_RESTБ24Сервер.НормализоватьID(Задача.Получить("id")) = ПредварительнаяОперация.ЗадачаId Тогда
                        Просрочена = Расш1_RESTБ24Сервер.СрокЗадачиИстек(Задача, ТекущаяУниверсальнаяДата());
                    КонецЕсли;
                КонецЕсли;
            КонецЕсли;
        Исключение
            // Недоступность чтения не препятствует сохранению уже подтверждённого ID.
        КонецПопытки;
    КонецЕсли;
    УстановитьПривилегированныйРежим(Истина);
    // Не читать документ под блокировками собственных регистров: его ПриЗаписи берёт
    // блокировки в противоположном направлении (документ → регистры).
    ТекущиеДанные = Неопределено; ЗаказОтменен = Ложь;
    Если ПредварительнаяОперация.Состояние = "ЗадачаИзвестна" Тогда
        Попытка
            ТекущиеДанные = ДанныеЗаказа(ПредварительнаяОперация.Заказ);
            ЗаказОтменен = ПрочитатьЖизненныйЦикл(ПредварительнаяОперация.Заказ).Отменен;
        Исключение
            // Отказ сравнения не отменяет запись уже подтверждённой связи.
        КонецПопытки;
    КонецЕсли;
    НачатьТранзакцию();
    Попытка
        Блокировать(); Операция = ЗаписьОперации(ОперацияId);
        Если Операция.Выбран() И Операция.Состояние = "ЗадачаИзвестна" И Не ПустаяСтрока(Операция.ЗадачаId) Тогда
            Состояние = ЗаписьСостояния(Операция.Заказ); Связь = СвязьЗаказа(Операция.Заказ);
            Запрос = Новый Запрос("ВЫБРАТЬ Заказ ИЗ РегистрСведений.Расш1_СвязиЗаказовБ24 ГДЕ ЗадачаId = &ID И Заказ <> &Заказ");
            Запрос.УстановитьПараметр("ID", Операция.ЗадачаId); Запрос.УстановитьПараметр("Заказ", Операция.Заказ);
            Конфликт = Состояние.ОперацияId <> ОперацияId Или Состояние.ВерсияСвязи <> Операция.ВерсияСвязи
                Или Связь.Выбран() Или Не Запрос.Выполнить().Пустой();
            Если Конфликт Тогда
                Операция.Состояние = "Конфликт";
                Уведомление(Операция, "conflict", "Задача №" + Операция.ЗадачаId + " создана. Связь не изменена из-за конфликта; требуется программист.");
            Иначе
                Связь.ЗадачаId = Операция.ЗадачаId; Связь.ОперацияId = ОперацияId;
                Связь.Портал = Операция.Портал; Связь.Ссылка = Операция.Ссылка; Связь.Название = Операция.Название; Связь.Записать();
                Состояние.ВерсияСвязи = Состояние.ВерсияСвязи + 1; Состояние.Записать();
                Операция.ВерсияСвязи = Состояние.ВерсияСвязи; Операция.Состояние = "Завершена";
                Снимок = Расш1_RESTБ24Сервер.ДанныеJSON(Операция.СнимокJSON).Получить("order");
                Текст = "По заказу №" + Снимок.Получить("Номер") + " от " + Снимок.Получить("Дата") + " создана задача №" + Операция.ЗадачаId;
                Если ТекущиеДанные <> Неопределено Тогда
                    Для Каждого Поле Из СтрРазделить("Номер,Дата,Контрагент,Клиент,Сумма,Валюта,Ссылка", ",") Цикл
                        Если ТекущиеДанные[Поле] <> Снимок.Получить(Поле) Тогда
                            Текст = Текст + Символы.ПС + "Данные заказа изменены. Задача содержит данные на момент начала создания.";
                            Прервать;
                        КонецЕсли;
                    КонецЦикла;
                    Если ТекущиеДанные.ПометкаУдаления Тогда
                        Текст = Текст + Символы.ПС + "Заказ помечен на удаление. Проверьте связанную задачу; задача и связь сохранены.";
                    КонецЕсли;
                Иначе
                    Текст = Текст + Символы.ПС + "Не удалось сверить актуальные данные заказа. Проверьте заказ и задачу.";
                КонецЕсли;
                Если ЗаказОтменен Тогда
                    Текст = Текст + Символы.ПС + "Заказ отменён. Проверьте связанную задачу; задача и связь сохранены.";
                КонецЕсли;
                Если Просрочена Тогда Текст = Текст + Символы.ПС + "Срок задачи уже истёк. Проверьте задачу в Битрикс24."; КонецЕсли;
                Уведомление(Операция, "success", Текст);
                Известно = РегистрыСведений.Расш1_УведомленияБ24.СоздатьМенеджерЗаписи();
                Известно.СообщениеId = ОперацияId + ":known"; Известно.Прочитать();
                Если Известно.Выбран() Тогда Известно.Доставлено = Истина; Известно.Записать(); КонецЕсли;
                Аудит(Операция.Заказ, Операция.ИнициаторId, "Создание", "", Операция.ЗадачаId, Операция.Портал, ОперацияId);
            КонецЕсли;
            Операция.Записать();
        КонецЕсли;
        ЗафиксироватьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим);
    Исключение
        ОтменитьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим);
        // ID уже устойчиво сохранён. Следующий запуск/опрос повторяет только запись связи.
    КонецПопытки;
КонецПроцедуры

// В этой КА нет реквизита «Отменён» у всего заказа. Учитывать отмену всех строк либо
// закрытие с отменёнными строками; закрытие выполненного заказа без отмены не считать отменой.
Функция ПрочитатьЖизненныйЦикл(Заказ) Экспорт
    Итог = Новый Структура("ПометкаУдаления,Отменен", Ложь, Ложь);
    Если Не ЗначениеЗаполнено(Заказ) Тогда Возврат Итог; КонецЕсли;
    Запрос = Новый Запрос("ВЫБРАТЬ ПометкаУдаления, Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт) КАК Закрыт ИЗ Документ.ЗаказКлиента ГДЕ Ссылка = &Заказ");
    Запрос.УстановитьПараметр("Заказ", Заказ); Строки = Запрос.Выполнить().Выбрать();
    Закрыт = Ложь;
    Если Строки.Следующий() Тогда Итог.ПометкаУдаления = Строки.ПометкаУдаления; Закрыт = Строки.Закрыт; КонецЕсли;
    Запрос = Новый Запрос("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК Всего,
        |СУММА(ВЫБОР КОГДА Отменено ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК Отменено
        |ИЗ Документ.ЗаказКлиента.Товары ГДЕ Ссылка = &Заказ");
    Запрос.УстановитьПараметр("Заказ", Заказ); Строки = Запрос.Выполнить().Выбрать();
    Если Строки.Следующий() Тогда Итог.Отменен = Строки.Всего > 0 И (Строки.Отменено = Строки.Всего Или (Закрыт И Строки.Отменено > 0)); КонецЕсли;
    Возврат Итог;
КонецФункции

// Вызывается после штатного ПриЗаписи внутри той же транзакции: сообщение становится
// видимым только после успешной фиксации заказа. HTTP и повторного проведения нет.
Процедура ЗафиксироватьЖизненныйЦикл(Заказ, Прежнее, Текущее) Экспорт
    Удаление = Не Прежнее.ПометкаУдаления И Текущее.ПометкаУдаления;
    Отмена = Не Прежнее.Отменен И Текущее.Отменен;
    Если Не Удаление И Не Отмена Тогда Возврат; КонецЕсли;
    Инициатор = ПользовательId();
    ИсходныйРежим = ПривилегированныйРежим(); УстановитьПривилегированныйРежим(Истина);
    Попытка
        Блокировать(); Связь = СвязьЗаказа(Заказ);
        Если Связь.Выбран() Тогда
            Состояние = ЗаписьСостояния(Заказ);
            Сообщение = РегистрыСведений.Расш1_УведомленияБ24.СоздатьМенеджерЗаписи();
            Сообщение.СообщениеId = Строка(Новый УникальныйИдентификатор) + ":lifecycle";
            Сообщение.Заказ = Заказ; Сообщение.ИнициаторId = Инициатор;
            Сообщение.ОперацияId = Связь.ОперацияId; Сообщение.ВерсияСвязи = Состояние.ВерсияСвязи;
            Сообщение.Текст = "Заказ отменён или помечен на удаление. Проверьте задачу №" + Связь.ЗадачаId + " в Битрикс24; задача и связь сохранены.";
            Сообщение.Записать();
        КонецЕсли;
        УстановитьПривилегированныйРежим(ИсходныйРежим);
    Исключение
        УстановитьПривилегированныйРежим(ИсходныйРежим);
        // Ошибка интеграции не отменяет штатную запись заказа.
    КонецПопытки;
КонецПроцедуры

Процедура ВосстановитьОперацию(ОперацияId) Экспорт
    ИсходныйРежим = ПривилегированныйРежим(); УстановитьПривилегированныйРежим(Истина);
    НачатьТранзакцию();
    Попытка
        Блокировать(); Операция = ЗаписьОперации(ОперацияId);
        Если Операция.Выбран() И Операция.Состояние = "Резерв" И Не Операция.ОтправкаНачата Тогда
            // Не запущенная попытка не становится очередью отправки.
            Операция.Состояние = "НеОтправлена";
            Уведомление(Операция, "not-sent", "Задача не создана. Повторите позже"); Операция.Записать();
        КонецЕсли;
        Если Операция.Выбран() И Операция.Состояние = "ОтправкаНачата" Тогда
            Операция.Состояние = "Неизвестно"; Операция.Записать();
        КонецЕсли;
        Состояние = Операция.Состояние;
        Если Состояние = "Неизвестно" Тогда
            Операция.СледующаяПроверкаUTC = ТекущаяУниверсальнаяДата() + 5; Операция.Записать();
        КонецЕсли;
        ЗафиксироватьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим);
    Исключение
        ОтменитьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим); ВызватьИсключение;
    КонецПопытки;
    Если Состояние = "Неизвестно" Тогда
        Снимок = Расш1_RESTБ24Сервер.ДанныеJSON(Операция.СнимокJSON);
        Ответ = Расш1_RESTБ24Сервер.НайтиПоМаркеру(Операция.Портал, Снимок.Получить("fields").Получить("XML_ID"));
        СохранитьОтвет(ОперацияId, Ответ);
        Если Ответ.Состояние = "ЗадачаИзвестна" Тогда ЗаписатьСвязь(ОперацияId); КонецЕсли;
    ИначеЕсли Состояние = "ЗадачаИзвестна" Тогда
        ЗаписатьСвязь(ОперацияId);
    КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьОперацию(ОперацияId, Отправка) Экспорт
    Если Отправка Тогда ОтправитьОперацию(ОперацияId); Иначе ВосстановитьОперацию(ОперацияId); КонецЕсли;
КонецПроцедуры

Процедура ЗапуститьЗадание(ОперацияId, Отправка = Ложь) Экспорт
    Параметры = Новый Массив; Параметры.Добавить(ОперацияId); Параметры.Добавить(Отправка);
    // Одинаковые метод и ключ для отправки/восстановления: единая защита платформы от параллельных заданий.
    ФоновыеЗадания.Выполнить("Расш1_ОперацииRESTБ24.ВыполнитьОперацию", Параметры, "KA2:" + ОперацияId, "Битрикс24: заказ");
КонецПроцедуры

Процедура ЗапуститьВосстановление() Экспорт
    Если Не ПравоДоступа("Чтение", Метаданные.Документы.ЗаказКлиента) Тогда Возврат; КонецЕсли;
    ИсходныйРежим = ПривилегированныйРежим(); УстановитьПривилегированныйРежим(Истина);
    Попытка
        Запрос = Новый Запрос("ВЫБРАТЬ ОперацияId ИЗ РегистрСведений.Расш1_ЖурналОперацийБ24
            |ГДЕ Состояние В (""Резерв"", ""ОтправкаНачата"", ""Неизвестно"", ""ЗадачаИзвестна"")
            |И СледующаяПроверкаUTC <= &Сейчас");
        Запрос.УстановитьПараметр("Сейчас", ТекущаяУниверсальнаяДата()); Строки = Запрос.Выполнить().Выгрузить();
        УстановитьПривилегированныйРежим(ИсходныйРежим);
    Исключение
        УстановитьПривилегированныйРежим(ИсходныйРежим); ВызватьИсключение;
    КонецПопытки;
    Для Каждого Строка Из Строки Цикл
        Попытка ЗапуститьЗадание(Строка.ОперацияId); Исключение КонецПопытки;
    КонецЦикла;
КонецПроцедуры

Функция ПрочитатьСостояние(Заказ) Экспорт
    ПроверитьДоступ(Заказ);
    ИсходныйРежим = ПривилегированныйРежим(); УстановитьПривилегированныйРежим(Истина);
    Попытка
        Связь = СвязьЗаказа(Заказ); Состояние = ЗаписьСостояния(Заказ); Операция = ЗаписьОперации(Состояние.ОперацияId);
        Итог = Новый Структура("Состояние,ОперацияId,ЗадачаId,Название,Ссылка,ВерсияСвязи,ПоследняяУдаленнаяЗадача", "Нет", "", "", "", "", Состояние.ВерсияСвязи, Состояние.ПоследняяУдаленнаяЗадача);
        Если Связь.Выбран() Тогда
            Итог.Состояние = "Связана"; ЗаполнитьЗначенияСвойств(Итог, Связь);
        ИначеЕсли Операция.Выбран() И Операция.Состояние <> "Завершена" Тогда
            ЗаполнитьЗначенияСвойств(Итог, Операция);
        КонецЕсли;
        УстановитьПривилегированныйРежим(ИсходныйРежим);
    Исключение
        УстановитьПривилегированныйРежим(ИсходныйРежим); ВызватьИсключение;
    КонецПопытки;
    Возврат Итог;
КонецФункции

Функция ПолучитьУведомления() Экспорт
    Инициатор = ПользовательId();
    ИсходныйРежим = ПривилегированныйРежим(); УстановитьПривилегированныйРежим(Истина);
    Попытка
        Запрос = Новый Запрос("ВЫБРАТЬ СообщениеId, Заказ, Текст, ВерсияСвязи
            |ИЗ РегистрСведений.Расш1_УведомленияБ24 ГДЕ ИнициаторId = &Инициатор И НЕ Доставлено");
        Запрос.УстановитьПараметр("Инициатор", Инициатор); Строки = Запрос.Выполнить().Выгрузить();
        УстановитьПривилегированныйРежим(ИсходныйРежим);
    Исключение
        УстановитьПривилегированныйРежим(ИсходныйРежим); ВызватьИсключение;
    КонецПопытки;
    Итог = Новый Массив;
    Для Каждого Строка Из Строки Цикл
        Попытка
            Состояние = ПрочитатьСостояние(Строка.Заказ);
            Текст = Строка.Текст;
            Если Состояние.ВерсияСвязи <> Строка.ВерсияСвязи Тогда
                Текст = Текст + Символы.ПС + "После создания связь изменили или удалили. Текущее состояние смотрите в заказе.";
            КонецЕсли;
            Итог.Добавить(Новый Структура("СообщениеId,Текст", Строка.СообщениеId, Текст));
        Исключение
            // Отсутствие доступа к исходному заказу не раскрывает его данные и не подтверждает показ.
        КонецПопытки;
    КонецЦикла;
    Возврат Итог;
КонецФункции

Процедура ПодтвердитьПоказ(СообщениеId) Экспорт
    Инициатор = ПользовательId();
    ИсходныйРежим = ПривилегированныйРежим(); УстановитьПривилегированныйРежим(Истина);
    НачатьТранзакцию();
    Попытка
        Блокировка = Новый БлокировкаДанных;
        Область = Блокировка.Добавить("РегистрСведений.Расш1_УведомленияБ24");
        Область.Режим = РежимБлокировкиДанных.Исключительный; Область.УстановитьЗначение("СообщениеId", СообщениеId);
        Блокировка.Заблокировать();
        Запись = РегистрыСведений.Расш1_УведомленияБ24.СоздатьМенеджерЗаписи();
        Запись.СообщениеId = СообщениеId; Запись.Прочитать();
        Если Запись.Выбран() И Запись.ИнициаторId = Инициатор Тогда
            Запись.Доставлено = Истина; Запись.Записать();
        КонецЕсли;
        ЗафиксироватьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим);
    Исключение
        ОтменитьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим); ВызватьИсключение;
    КонецПопытки;
КонецПроцедуры

// Ручные действия остаются отдельными от проведения и создания.
// Ожидаемая версия обязательна: устаревшая форма не заменяет более новую связь.
Процедура ИзменитьСвязь(Заказ, ЗадачаId, ОжидаемаяВерсия) Экспорт
    ПроверитьДоступ(Заказ, Истина);
    Если ТипЗнч(ОжидаемаяВерсия) <> Тип("Число") Тогда ВызватьИсключение "Обновите состояние заказа."; КонецЕсли;
    // Ранний отказ без сети и без начала вложенной транзакции. Под блокировкой проверить повторно.
    Предварительное = ПрочитатьСостояние(Заказ);
    Если Предварительное.ВерсияСвязи <> ОжидаемаяВерсия Тогда ВызватьИсключение "Связь уже изменена. Обновите заказ."; КонецЕсли;
    Если Предварительное.Состояние = "Резерв" Или Предварительное.Состояние = "ОтправкаНачата"
        Или Предварительное.Состояние = "Неизвестно" Или Предварительное.Состояние = "ЗадачаИзвестна" Или Предварительное.Состояние = "Конфликт" Тогда
        ВызватьИсключение "Дождитесь завершения проверки создания задачи.";
    КонецЕсли;
    Инициатор = ПользовательId();
    Портал = ""; Название = ""; Ссылка = ""; Маркер = "";
    Если Не ПустаяСтрока(ЗадачаId) Тогда
        Если Расш1_RESTБ24Сервер.НормализоватьID(ЗадачаId) <> ЗадачаId Тогда ВызватьИсключение "Неверный ID задачи."; КонецЕсли;
        Параметры = Расш1_RESTБ24Сервер.ПараметрыНовойОперации(); Портал = Параметры.Портал;
        Ответ = Расш1_RESTБ24Сервер.ПрочитатьЗадачуREST(Число(ЗадачаId));
        Если Ответ.Состояние <> "Результат" Тогда ВызватьИсключение "Не удалось проверить задачу. Связь не изменена."; КонецЕсли;
        Задача = Ответ.Данные.Получить("task");
        Если ТипЗнч(Задача) <> Тип("Соответствие") Тогда ВызватьИсключение "Не удалось проверить задачу."; КонецЕсли;
        Если Расш1_RESTБ24Сервер.НормализоватьID(Задача.Получить("id")) <> ЗадачаId Тогда ВызватьИсключение "Неверный ответ Битрикс24."; КонецЕсли;
        Название = Строка(Задача.Получить("title")); Маркер = Строка(Задача.Получить("xmlId"));
        Исполнитель = Расш1_RESTБ24Сервер.НормализоватьID(Задача.Получить("responsibleId"));
        Если ПустаяСтрока(Исполнитель) Тогда ВызватьИсключение "Неверный ответ Битрикс24."; КонецЕсли;
        Ссылка = "https://" + Портал + "/company/personal/user/" + Исполнитель + "/tasks/task/view/" + ЗадачаId + "/";
    КонецЕсли;
    ИсходныйРежим = ПривилегированныйРежим(); УстановитьПривилегированныйРежим(Истина);
    НачатьТранзакцию();
    Попытка
        Блокировать(); Состояние = ЗаписьСостояния(Заказ); Операция = ЗаписьОперации(Состояние.ОперацияId);
        Если Состояние.ВерсияСвязи <> ОжидаемаяВерсия Тогда ВызватьИсключение "Связь уже изменена. Обновите заказ."; КонецЕсли;
        Если Операция.Выбран() И Незавершена(Операция.Состояние) Тогда
            ВызватьИсключение "Дождитесь завершения проверки создания задачи.";
        КонецЕсли;
        Если Лев(Маркер, 4) = "KA2:" Тогда
            Если СтрДлина(Маркер) <> 40 И СтрДлина(Маркер) <> 77 Тогда ВызватьИсключение "Задача имеет непроверенный маркер интеграции."; КонецЕсли;
            Чужая = ЗаписьОперации(Прав(Маркер, 36));
            Если Не Чужая.Выбран() Тогда
                ВызватьИсключение "Задача относится к непроверенной операции интеграции.";
            КонецЕсли;
            ЧужойСнимок = Расш1_RESTБ24Сервер.ДанныеJSON(Чужая.СнимокJSON);
            Если Маркер <> ЧужойСнимок.Получить("fields").Получить("XML_ID") Тогда
                ВызватьИсключение "Задача относится к непроверенной операции интеграции.";
            КонецЕсли;
            Если Чужая.Заказ <> Заказ И Незавершена(Чужая.Состояние) Тогда
                ВызватьИсключение "Задача относится к незавершённой операции другого заказа.";
            КонецЕсли;
        КонецЕсли;
        Связь = СвязьЗаказа(Заказ); Прежняя = Связь.ЗадачаId;
        Если Не Связь.Выбран() И ПустаяСтрока(ЗадачаId) Тогда
            ЗафиксироватьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим); Возврат;
        КонецЕсли;
        Если Связь.Выбран() И Прежняя = ЗадачаId И Связь.Портал = Портал Тогда
            ЗафиксироватьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим); Возврат;
        КонецЕсли;
        Если Не ПустаяСтрока(ЗадачаId) Тогда
            Запрос = Новый Запрос("ВЫБРАТЬ Заказ ИЗ РегистрСведений.Расш1_СвязиЗаказовБ24 ГДЕ ЗадачаId = &ID И Заказ <> &Заказ");
            Запрос.УстановитьПараметр("ID", ЗадачаId); Запрос.УстановитьПараметр("Заказ", Заказ);
            Если Не Запрос.Выполнить().Пустой() Тогда ВызватьИсключение "Задача уже связана с другим заказом."; КонецЕсли;
        КонецЕсли;
        Если Связь.Выбран() Тогда Связь.Удалить(); КонецЕсли;
        Действие = "РучнаяПривязка";
        Если ПустаяСтрока(ЗадачаId) Тогда
            Действие = "УдалениеСвязи";
            Если Не ПустаяСтрока(Прежняя) Тогда Состояние.ПоследняяУдаленнаяЗадача = Прежняя; КонецЕсли;
        Иначе
            Связь = СвязьЗаказа(Заказ); Связь.ЗадачаId = ЗадачаId; Связь.Портал = Портал;
            Связь.Название = Название; Связь.Ссылка = Ссылка;
            Связь.ОперацияId = Строка(Новый УникальныйИдентификатор); Связь.Записать();
        КонецЕсли;
        Состояние.ВерсияСвязи = Состояние.ВерсияСвязи + 1; Состояние.Записать();
        Аудит(Заказ, Инициатор, Действие, Прежняя, ЗадачаId, Портал, Состояние.ОперацияId);
        ЗафиксироватьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим);
    Исключение
        ОтменитьТранзакцию(); УстановитьПривилегированныйРежим(ИсходныйРежим); ВызватьИсключение;
    КонецПопытки;
КонецПроцедуры
